[
  {
    "headline": {
      "text": "OCTA SURVEY SHOWS UPTICK IN PBBM, SPEAKER RATINGS",
      "coordinate": [
        174,
        502,
        3574,
        685
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "PRESIDENT Ferdinand Marcos Jr. and House Speaker Martin Romualdez saw marked improvements in their trust and performance ratings, according to the latest Tugon ng Masa (TNM) survey released by OCTA Research yesterday. At the same time, Vice President Sara Duterte-Carpio and Senate President Francis Escudero logged notable declines. Mr. Marcos emerged as the top-performing official in the second-quarter survey, with a 4-point increase in trust rating (64%) and a 3-point rise in performance rating (62%). While the latter remains within the margin of error, OCTA noted that the consistent upward trend signals a “genuine and positive shift” in public perception. The improvements marked a reversal of the downward trend observed since late 2024, highlighting what OCTA describes as a renewed public (Next page)",
      "coordinate": []
    },
    "byline": {
      "text": "By Rex Espiritu and Maricel V. Cruz",
      "coordinate": [
        111,
        733,
        574,
        864
      ]
    }
  },
  {
    "headline": {
      "text": "Poor flood-control partly due to budget insertions—DPWH",
      "coordinate": [
        2986,
        1504,
        3644,
        1848
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "THE Department of Public Works and Highways (DPWH) deflected blame for failed flood-control projects, pointing out that some lawmakers earmarked funding for projects without first seeking the agency’s technical guidance. (Next page)",
      "coordinate": []
    },
    "byline": {
      "text": "By Vito Barcelo, Ram Superable, and Maricel V. Cruz",
      "coordinate": []
    }
  },
  {
    "headline": {
      "text": "DILG: Full-blast probe on public funds misuse",
      "coordinate": [
        95,
        1455,
        2963,
        2252
      ]
    },
    "subheadline": {
      "text": "Remulla to convene NCR mayors over flood response",
      "coordinate": [
        129,
        2259,
        2872,
        2422
      ]
    },
    "body": {
      "text": "INTERIOR Secretary Jonvic Remulla vowed to go “full blast” in investigating alleged misuse of public funds meant for infrastructure projects as he pushed for an integrated approach to waste management as a long-term measure to address flooding. Following marching orders from President Ferdinand Marcos Jr. in his fourth State of the Nation Address, Remulla said the DILG will look into allegations of corruption and misuse of public funds in government projects. “I will give it to the investigation side of the DILG. We are going to go full blast on that. We will make sure that we cover [everything],” he said in an interview with PTV. During his SONA on Monday, Mr. Marcos ordered a full audit of all flood (Next page)",
      "coordinate": []
    },
    "byline": {
      "text": "By Rex Espiritu, Pot Chavez and Vito Barcelo",
      "coordinate": [
        111,
        2494,
        516,
        2673
      ]
    }
  },
  {
    "headline": {
      "text": "Remulla to convene NCR mayors over flood response",
      "coordinate": [
        129,
        2259,
        2872,
        2422
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "INTERIOR Secretary Jonvic Remulla vowed to go “full blast” in investigating alleged misuse of public funds meant for infrastructure projects as he pushed for an integrated approach to waste management as a long-term measure to address flooding. Following marching orders from President Ferdinand Marcos Jr. in his fourth State of the Nation Address, Remulla said the DILG will look into allegations of corruption and misuse of public funds in government projects. “I will give it to the investigation side of the DILG. We are going to go full blast on that. We will make sure that we cover [everything],” he said in an interview with PTV. During his SONA on Monday, Mr. Marcos ordered a full audit of all flood (Next page)",
      "coordinate": []
    },
    "byline": {
      "text": "By Rex Espiritu, Pot Chavez and Vito Barcelo",
      "coordinate": [
        111,
        2494,
        516,
        2673
      ]
    }
  },
  {
    "headline": {
      "text": "Human skull, teeth from Taal Lake raise hope for DNA—DOJ",
      "coordinate": [
        2275,
        4360,
        3630,
        4664
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "A HUMAN skull with teeth and additional bones were recovered from Taal Lake, raising the possibility of DNA extraction from the remains, Justice Secretary Jesus Crispin Remulla said yesterday. “Some remains were found there, that will be examined,” Remulla said in a briefing. “Yes, there were teeth in the skull. We don’t know if it has a lower jaw,” he added, noting that the teeth may still contain usable DNA. The remains, which include an upper jaw and teeth, were discovered within a pre-identified quadrant of the lake and are now under the custody of the Philippine National Police (PNP) for further forensic analysis. “It looks like only one person was (Next page)",
      "coordinate": []
    },
    "byline": {
      "text": "By Pot Chavez",
      "coordinate": [
        2278,
        4683,
        2620,
        4751
      ]
    }
  },
  {
    "headline": {
      "text": "Pres'l adviser, 2 others charged with indirect contempt before SC",
      "coordinate": [
        101,
        5793,
        1481,
        6083
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "PETITIONS for indirect contempt were filed before the Supreme Court (SC) on Wednesday against Presidential Adviser for Poverty Alleviation Larry Gadon and two others over alleged improper remarks directed at the High Court. Lawyer Ferdinand Topacio filed the petition against Gadon, while lawyers Mark Kristopher Tolentino and Rolex Suplico lodged a separate petition against political party-list Akbayan and Heydarian and Akbayan Rep. Percival Cendaña. (Next page)",
      "coordinate": []
    },
    "byline": {
      "text": "By Pot Chavez, Vito Barcelo, and Ram Superable",
      "coordinate": [
        111,
        6104,
        590,
        6296
      ]
    }
  },
  {
    "headline": {
      "text": "House elects new committee heads",
      "coordinate": [
        1567,
        5828,
        2165,
        6062
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "THE House of Representatives elected new leaders to several key committees in a major move to strengthen legislative oversight, fiscal discipline, and coordination of the chamber’s proceedings. (Next page)",
      "coordinate": []
    },
    "byline": {
      "text": "By Maricel V. Cruz",
      "coordinate": [
        1582,
        6101,
        2008,
        6169
      ]
    }
  }
]