[
  {
    "headline": {
      "text": "House to open bicam to public",
      "coordinate": [
        114,
        1646,
        3690,
        2085
      ]
    },
    "subheadline": {
      "text": "Senate minority bloc backs more transparency to end corruption",
      "coordinate": [
        185,
        2049,
        3571,
        2232
      ]
    },
    "body": {
      "text": "THE House of Representatives said it will open to civil society observers and watchdogs the traditionally closed bicameral conference committee — a historic reform that would usher in a new era of transparency and public accountability in government budget. “We will seek to open the bicameral budget conference to civil society observers — a historic first. Because it is not just a weapon against corruption. It will only earn public trust but will also mean inclusive and participatory governance,” said Speaker Ferdinand Martin G. Romualdez during his address at the opening session yesterday of the House of Representatives. Ver Noveno",
      "coordinate": []
    },
    "byline": {
      "text": "By Maricel Cruz, Charles Dantes, Darwin G. Amojelar and Ram Superable",
      "coordinate": [
        111,
        2239,
        1186,
        2350
      ]
    }
  },
  {
    "headline": {
      "text": "Solons to prioritize social protection measures",
      "coordinate": [
        1537,
        2975,
        3596,
        3172
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "THE House of Representatives will center its legislative work on the urgent needs of ordinary Filipinos in the 20th Congress, with a focus on food, employment, education, and public health. “We will build an economy not just for the top one percent, but for the struggling 99 percent. For everyone to survive, they succeed,” Speaker Martin Romualdez said in a speech during the resumption of session Tuesday. “Congress should not be the home of the privileged, but the pillar of the people’s aspirations. Congress should provide an avenue for everyone to be heard and ensure that the voices of the marginalized are given the platform they deserve.” Romualdez, a cousin of President Ferdinand Marcos Jr., also pledged to prioritize social protection measures to ensure that no Filipino is left behind. He vowed to pass legislation that will create more jobs, enhance education, and expand access to healthcare. Romualdez also called for unity among lawmakers to address the challenges facing the country. He urged them to set aside political differences and work together for the common good. “We have a tremendous responsibility to serve our constituents, and we must do everything in our power to improve their lives,” Romualdez said. “Let us put aside our differences and work together to build a better future for our country.” The Speaker also reiterated his commitment to transparency and accountability in government. He vowed to crack down on corruption and ensure that public funds are used wisely. “We will not tolerate any form of corruption in government. We will ensure that every peso of public funds is used for the benefit of our people,” Romualdez said. Next page",
      "coordinate": []
    },
    "byline": {
      "text": "By Maricel V. Cruz",
      "coordinate": [
        1555,
        3153,
        1929,
        3216
      ]
    }
  },
  {
    "headline": {
      "text": "PH MAY LOSE P6B TO US ZERO TARIFF",
      "coordinate": [
        166,
        3763,
        746,
        3952
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "",
      "coordinate": []
    },
    "byline": {
      "text": "",
      "coordinate": []
    }
  },
  {
    "headline": {
      "text": "GRAFT RAPS VS. EX-OWWA CHIEF",
      "coordinate": [
        884,
        3763,
        1388,
        3951
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "",
      "coordinate": []
    },
    "byline": {
      "text": "",
      "coordinate": []
    }
  },
  {
    "headline": {
      "text": "DPWH readies list of flood control projects; DepDev draws up protocols",
      "coordinate": [
        96,
        4206,
        1529,
        4527
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "THE Department of Public Works and Highways (DPWH) is ready to submit a list of all flood control projects completed in the past three years under the Marcos administration amid the President’s call to weed out ghost projects. DPWH Secretary Manuel Bonoan made the remarks in an interview following President Ferdinand Marcos Jr.’s call in his state of the nation address (SONA) to audit all flood control projects to ensure that they are implemented efficiently and effectively. Bonoan said the DPWH has already completed a comprehensive inventory of all flood control projects and has identified those that are either ongoing or have been completed in the past three years. He added that the department is working closely with the Department of Budget and Management (DBM) to ensure that all flood control projects are properly funded and implemented. “We are committed to President Marcos’s directive to ensure that all flood control projects are implemented efficiently and effectively,” Bonoan said. “We will not tolerate any form of corruption or irregularities in the implementation of these projects.” The DPWH Secretary also emphasized the importance of public participation in monitoring flood control projects. He urged the public to report any irregularities or concerns to the department. “We believe that public participation is essential in ensuring transparency and accountability in the implementation of flood control projects,” Bonoan said. “We encourage everyone to report any irregularities or concerns to us.” Meanwhile, the Department of Development (DepDev) has drawn up protocols for identifying and prioritizing flood control projects. The DepDev protocols aim to ensure that flood control projects are aligned with national development goals and that they address the most pressing needs of vulnerable communities. DepDev Secretary Sarah Reyes said the protocols will guide local government units (LGUs) in identifying and prioritizing flood control projects. She added that the protocols will also ensure that flood control projects are integrated with other development initiatives. “We are committed to working with LGUs to ensure that flood control projects are implemented effectively and sustainably,” Reyes said. “We believe that these protocols will help us achieve our goal of building resilient communities.” Next page",
      "coordinate": []
    },
    "byline": {
      "text": "By Vito Barcelo",
      "coordinate": [
        112,
        4520,
        431,
        4576
      ]
    }
  },
  {
    "headline": {
      "text": "DOH explains zero-billing coverage, where it can be available",
      "coordinate": [
        100,
        4942,
        2594,
        5140
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "THE Department of Health (DOH) on Tuesday confirmed that the government’s newly announced zero-balance billing policy will initially be implemented only in hospitals under its management. This announcement comes after President Ferdinand Marcos Jr. declared in his State of the Nation Address (SONA) that patients in DOH hospitals will no longer have to pay for services under basic accommodations. DOH Assistant Secretary Albert Francis Domingo also clarified that guarantee letters from politicians should no longer be necessary, referencing a Supreme Court ruling that prohibits post-enactment interference in the disbursement of government budgets. “The national budget is approved and implemented, there should be no more need for guarantee letters. This policy effectively ensures that DOH hospitals are truly providing zero-billing to all eligible patients, regardless of their political connections,” Domingo stated. This move aims to streamline processes and prevent undue influence in healthcare service provision. The DOH is currently working on the implementing rules and regulations (IRR) for the zero-balance billing policy, which is expected to be finalized soon. The IRR will provide clear guidelines on patient eligibility, scope of services covered, and the process for availing the zero-billing privilege. Domingo also emphasized that the DOH is committed to ensuring that all Filipinos have access to affordable and quality healthcare. “This zero-billing policy is a significant step towards achieving universal healthcare coverage in the Philippines,” he said. “We will continue to work tirelessly to ensure that no Filipino is left behind when it comes to healthcare.” Next page",
      "coordinate": []
    },
    "byline": {
      "text": "By Ram Superable",
      "coordinate": [
        1541,
        5796,
        1923,
        5852
      ]
    }
  },
  {
    "headline": {
      "text": "Senate vote to continue or junk VP impeach trial set for Aug. 6",
      "coordinate": [
        1525,
        5491,
        2872,
        5804
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "THE Senate is scheduled to deliberate on the Supreme Court’s (SC) ruling that declared the Articles of Impeachment against Vice President Sara Duterte unconstitutional on August 6, 2025, Senate President Francis Escudero said Tuesday. During the plenary session, Escudero said the date was agreed upon during the all-party caucus to discuss the next steps on the impeachment complaint. The SC, in its ruling released earlier this month, declared the articles of impeachment unconstitutional, citing procedural irregularities in its adoption by the House of Representatives. Escudero said the Senate will tackle whether to continue or junk the impeachment trial based on the SC ruling. “We have to carefully review the SC decision and its implications on the impeachment process,” Escudero said. “We will ensure that due process is followed and that the Senate’s decision is in accordance with the Constitution.” He added that the Senate will also consider the public’s sentiment on the issue. “We understand the importance of this matter to our countrymen,” Escudero said. “We will take into account all perspectives before making a decision.” The impeachment complaint against Duterte stemmed from allegations of misuse of confidential funds and other irregularities during her term as Vice President. Next page",
      "coordinate": []
    },
    "byline": {
      "text": "By Ram Superable",
      "coordinate": [
        1541,
        5796,
        1923,
        5852
      ]
    }
  },
  {
    "headline": {
      "text": "DOJ chief bares new witness on ‘sabungeros’ case",
      "coordinate": [
        2980,
        5010,
        3614,
        5400
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "THE Department of Justice (DOJ) on Tuesday revealed that a new civilian witness has surfaced in the case of the missing sabungeros (cockfighting enthusiasts), expected to support the testimony of Alyas “Totoy”—identified as Julie “Dondon” Patidongan. In a chance interview with reporters, Justice Secretary Jesus Crispin Remulla said the new witness is crucial in strengthening the case against the suspects. “We have a new witness who will corroborate the statements of Alyas Totoy,” Remulla said. “This is a significant development in our efforts to bring justice to the families of the missing sabungeros.” The DOJ chief said the new witness, whose identity is being withheld for security reasons, has provided valuable information that could shed light on the circumstances surrounding the disappearance of the sabungeros. “We are confident that this new witness will help us unravel the truth behind this case,” Remulla said. “We will continue to pursue all leads until we find the perpetrators and hold them accountable.” The sabungeros case involves the disappearance of several cockfighting enthusiasts in different parts of the country since 2021. The families of the missing sabungeros have been appealing to the government for help in finding their loved ones. Next page",
      "coordinate": []
    },
    "byline": {
      "text": "By Pot Chavez and Vince Lopez",
      "coordinate": []
    }
  },
  {
    "headline": {
      "text": "Pag-IBIG special rate for expanded 4PH program",
      "coordinate": [
        1543,
        6148,
        3612,
        6341
      ]
    },
    "subheadline": {
      "text": "",
      "coordinate": []
    },
    "body": {
      "text": "PAG-IBIG Fund announced yesterday that it is offering a special subsidized interest rate of 3 percent per annum for the first five years of housing loans under the Expanded Pambansang Pabahay para sa Pilipino (Expanded 4PH) Program. The special rate is available to eligible members from the lowest income segments up to the median income level, as well as all overseas Filipino workers, for the purchase of socialized housing units — which now include house-and-lot units, condominium units, and Pag-IBIG Acquired Assets. This initiative aims to make housing more affordable and accessible to a wider range of Filipinos, particularly those who are struggling to own a home. The Pag-IBIG Fund also said that the special rate will help boost the government’s 4PH program, which aims to address the country’s housing backlog. “We are committed to supporting the government’s efforts to provide decent and affordable housing to all Filipinos,” Pag-IBIG Fund Chief Executive Officer Marilene Acosta said. “This special interest rate is our way of making housing more accessible to our members.” Acosta added that the Pag-IBIG Fund is continuously looking for ways to enhance its programs and services to better serve its members. “We want to ensure that every Filipino has the opportunity to achieve their dream of owning a home,” she said. The Pag-IBIG Fund is a government financial institution that provides housing loans, savings, and other benefits to its members. Next page",
      "coordinate": []
    },
    "byline": {
      "text": "",
      "coordinate": []
    }
  }
]